-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-11-22 10:39:27
-- 伺服器版本： 10.4.20-MariaDB
-- PHP 版本： 8.0.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `foodie`
--

-- --------------------------------------------------------

--
-- 資料表結構 `comment`
--

CREATE TABLE `comment` (
  `cid` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `sid` int(11) NOT NULL,
  `comment` text NOT NULL,
  `score` tinyint(5) NOT NULL DEFAULT 5,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `upgrated_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `comment`
--

INSERT INTO `comment` (`cid`, `user_id`, `sid`, `comment`, `score`, `created_at`, `upgrated_at`) VALUES
(1, 2, 1, '工業風的早午餐，爆漿多汁的漢堡肉，濃到化不開的豆漿，好吃啊！', 4, '2021-01-19 22:05:50', '2021-01-19 22:05:50'),
(2, 1, 1, '已經超久沒有吃到好吃的早午餐了餐廳風格跟餐點都走一種小清新的風格～餐點的部分都是非基改的新鮮蔬果，原汁原味超新鮮超好吃沒有過多的調味～套餐我比較推薦超級濃豆漿，氣泡水有渣渣我比較不喜歡，豆漿喝起來像燕麥奶一樣超神奇尾勁微微的甜味甜點的話每天都不一樣，今天是原味司康跟抹茶司康也是超級無敵好吃洛神花醬跟奶油栗子都很棒個人比較愛奶油栗子鹹甜鹹甜的味道很搭鬆軟的司康  洛神酸甜酸甜可以解膩。\r\n總結是一間超過五顆星的優質店家，店員的服務態度也是好到無話可說總之是一間會常去的下午茶兼早午餐', 5, '2021-02-19 22:05:50', '2021-02-19 22:05:50'),
(3, 2, 2, '不知是否受疫情影響，可以選擇的菜品並沒有如網路上的菜單那麼多？\r\n本來期待可以吃到山藥細麵、海膽軍艦、花枝握壽司等通通都沒有，讓人覺得很失望。\r\n焦糖地瓜外表脆內心軟，非常好吃值得推薦（但是沒有拍到照片），整體味道表現不錯但是價格及份量讓人覺得CP值不高；惟服務人員動作積極態度良好。', 3, '2021-03-19 22:05:50', '2021-03-19 22:05:50'),
(4, 4, 2, '桃園出差下來中部\n聞4500評論而來，果真很不一樣\n首先想跟一笈壽司說\n員工教育訓練上真的很不錯\n從進來到位置上然後用餐結束離開\n接洽人員,帶位人員,上餐的人員，結帳人員\n態度都非常的棒\n尤其是羅玉如妹妹\n一笈有你這種非常的細心員工\n真是他們的福氣，值得獎勵\n鮭魚一品新鮮軟嫩\n笈三寶簡單不平凡(蟹肉滿意)\n鮮蝦手捲蝦甜餡多\n唐揚雞炸到恰到好處肉汁滿滿肉不乾柴\n茶碗蒸綿密沒氣泡\n焦糖鮮橙，橙意滿滿\n一笈用心，一級放心', 5, '2021-04-05 22:05:50', '2021-04-19 22:05:50'),
(5, 2, 1, '綠意盎然的門前，現代工業風的早餐店，假日及早來卡位，也有咖啡豆可以選擇外帶，餐點豐富多元，套餐份量足，cp值高，帕尼尼香酥脆口感餡料豐富，靠窗的坐位暖暖陽光灑落在窗邊很舒服，服務也很好，是北屯區早午餐的好選擇', 5, '2021-04-11 22:05:50', '2021-04-11 22:05:50'),
(6, 4, 1, '原味司康有兩種醬可以選\r\n有栗子奶酪醬、水果醬可以選\r\n我們這次選的是栗子奶酪醬?\r\n栗子味沒有很重，然後可能是因為還有奶酪的關係\r\n所以整體醬的味到也是有點偏起司的酸～', 5, '2021-04-12 22:05:50', '2021-04-12 22:05:50'),
(7, 3, 4, '甜度的話，以我螞蟻人的角度來說算適中\r\n而且也不會讓你的喉嚨太過黏膩，這點還不錯。', 4, '2021-04-14 22:05:50', '2021-04-14 22:05:50'),
(8, 1, 5, '一顆煉乳烤饅頭，不大也不會太小\r\n只要銅板價15元就能買到！！！\r\n不管是【當作早餐或宵夜吃，真的都非常適合】', 5, '2021-05-01 22:05:50', '2021-05-01 22:05:50'),
(9, 2, 6, '餅皮咬下去比我想像中來的薄、脆\r\n但吃的時候卻不知為何\r\n沒有特別感受到蚵仔的存在？', 5, '2021-05-06 22:05:50', '2021-05-06 22:05:50'),
(10, 3, 7, '大部份的餐點或飲品，幾乎都100有找\r\n等於花不到100就能拍到超美照片+待整天\r\n如果是喜歡或習慣去咖啡廳讀書、工作者\r\n這樣的價錢真的很值得推一個', 3, '2021-05-08 22:05:50', '2021-05-08 22:05:50'),
(11, 2, 8, '通常對於這種景觀餐廳，\r\n刻板印象都是食物普普，甚至是不優。\r\n但貝隆餐廳直接打破這種印象！！！\r\n認真覺得我們這次點的所有餐點（含酒）\r\n全都沒有雷欸！真的超級好吃！！！', 5, '2021-05-21 22:05:50', '2021-05-21 22:05:50'),
(12, 2, 9, '酥炸牛肉佐塔塔醬\r\n這道的塔塔醬真的是超級大加分！！！\r\n好吃到我和友人醬都吃完了還剩一堆肉條', 5, '2021-05-30 22:05:50', '2021-05-30 22:05:50'),
(13, 4, 10, '這次喝的 #春日紅茶 #春日牧奶茶剛好也是他們【最近推出的新品項】！\r\n這兩款新品體驗價也是到這週日為止\r\n想要嘗鮮的人可以趁機來品嘗看看～', 3, '2021-06-03 22:05:50', '2021-06-03 22:05:50'),
(14, 1, 11, '海鮮丼整體我覺得算是普通，\r\n不過鮭魚生魚片倒是還不錯。\r\n但它的醋飯我覺得不行，有點太黏，\r\n丼飯附的味噌湯我自己還蠻喜歡的，\r\n湯頭不會太鹹，算是清淡型的。', 5, '2021-06-04 22:05:50', '2021-06-04 22:05:50'),
(15, 6, 12, '大力推薦薯條控【松露薯條真的必點！】\r\n它是附一碟松露醬，而不是直接加在薯條上\r\n撒在薯條上那一糰的白色絲線，是起司！', 4, '2021-06-03 22:05:50', '2021-06-03 22:05:50'),
(16, 6, 4, '嬤寶是網紅濃濃 @ii_n_o_n_g 創立的食品品牌\r\n從最初的雪Q餅，到現在的新品—【姐夫布朗尼】\r\n每每才剛一上架，真的堪比在搶演唱會門票一樣！\r\n大家都是直接用秒速在搶的，真的很誇張！?', 5, '2021-06-06 22:05:50', '2021-06-06 22:05:50'),
(17, 5, 4, '個人覺得是整體來說還算不錯吃\r\n喜歡布朗尼的人可以買來試試～\r\n但如果說要到跟著瘋搶才能買到的話，\r\n個人是覺得不至於需要到這種程度。', 5, '2021-06-07 22:05:50', '2021-06-07 22:05:50'),
(18, 6, 4, '嬤寶是網紅濃濃 @ii_n_o_n_g 創立的食品品牌\r\n從最初的雪Q餅，到現在的新品—【姐夫布朗尼】\r\n每每才剛一上架，真的堪比在搶演唱會門票一樣！\r\n大家都是直接用秒速在搶的，真的很誇張！', 5, '2021-07-15 22:05:50', '2021-07-15 22:05:50'),
(19, 5, 4, '姐夫布朗尼其實算是嬤寶新品\r\n所以現在只要一到週六的上架時間\r\n真的不誇張，都會直接被粉絲以光速搶完！', 4, '2021-07-15 22:05:50', '2021-07-15 22:05:50'),
(20, 1, 2, '散壽司這一碗CP值真的非常高！\r\n裡面不只有鮭魚卵，還有三種生魚片塊！', 5, '2021-07-15 22:05:50', '2021-07-15 22:05:50'),
(21, 2, 3, '奶油明太子鮮蝦燉飯\r\n和義大利麵相比，個人覺得燉飯就變得比較普通\r\n但料給的也是很多、整體味道其實也是不錯', 5, '2021-08-01 22:05:50', '2021-08-01 22:05:50'),
(22, 3, 3, '清炒蒜香松阪豬義大利麵\r\n這道真的超好吃！麵體吸滿了醬汁，超入味！\r\n尤其是它的松阪豬！邊邊煎到赤赤的，很脆彈\r\n松阪豬的量也給得很大方！我真的超愛', 5, '2021-08-01 22:05:50', '2021-08-01 22:05:50'),
(23, 5, 3, '這間店的餐點份量都蠻大的\r\n算是CP值蠻高的，味道也都很不錯\r\n唯一小小可惜的是他們的內部裝潢\r\n和店的外觀相比，算是稍微偏老舊一點', 5, '2021-08-01 22:05:50', '2021-08-01 22:05:50'),
(24, 5, 5, '使用【碳火】燒烤的饅頭，讓饅頭充滿了碳火的香氣～烤到微焦脆的表層，更是增添了饅頭的口感。', 4, '2021-08-09 22:05:50', '2021-08-09 22:05:50'),
(25, 2, 5, '建議大家，最好是一個人就買2顆以上，不然你真的會不夠吃XD', 5, '2021-08-09 22:05:50', '2021-08-09 22:05:50'),
(26, 6, 6, '每一顆蚵蛋包裡，都放有約四顆的蚵仔\r\n再塞入滿滿的蔥、肉末，並打上一顆蛋\r\n最後放入油鍋，炸至表皮金黃，起鍋！', 5, '2021-08-09 22:05:50', '2021-08-09 22:05:50'),
(27, 1, 6, '大家都說來羅東夜市必吃這間蚵蛋包！想吃要做好排隊的心理準備喔XD', 3, '2021-08-09 22:05:50', '2021-08-09 22:05:50'),
(28, 1, 7, 'Slope Cafe也是間【單車咖啡廳】\r\n（店門口、室內的牆壁裝潢也，都掛有單車擺設）\r\n所以常有騎單車者，把車掛在外面的架子上，\r\n然後進店內買杯咖啡、餐點休憩一下～\r\n覺得這場景在一般咖啡廳較少見、蠻可愛的～', 5, '2021-08-17 22:05:50', '2021-08-17 22:05:50'),
(29, 2, 7, '鮪魚沙拉我個人沒有很推，因為我覺得整體吃下來，蠻乾的', 5, '2021-08-17 22:05:50', '2021-08-17 22:05:50'),
(30, 2, 10, '十杯的【珍珠】除了Ｑ之外，最特別的是【咬起來有蜂蜜味】～', 4, '2021-08-17 22:05:50', '2021-08-17 22:05:50'),
(31, 0, 10, '紫米的部份吃起來顆粒感較重，\r\n如果能再煮得更爛一點，我會更喜歡', 5, '2021-09-18 22:05:50', '2021-09-18 22:05:50'),
(33, 2, 10, '這次喝的 #春日紅茶 #春日牧奶茶\r\n剛好也是他們【最近推出的新品項】！\r\n這兩款新品體驗價也是到這週日為止\r\n想要嘗鮮的人可以趁機來品嘗看看～', 5, '2021-09-19 22:05:50', '2021-09-19 22:05:50'),
(34, 6, 8, '西班牙水果酒是改良自Sangria，以白酒代替紅酒~\r\n女孩們這邊請筆記起來！【務必點這杯！！！】\r\n因為【它不只好喝，重點是超好拍！！！】', 4, '2021-09-20 22:05:50', '2021-09-20 22:05:50'),
(35, 1, 8, '英式炸魚薯條 算是出乎我意料外的好吃！\r\n首先是炸魚的【肉質！真的超！級！嫩！！！】', 5, '2021-09-20 22:05:50', '2021-09-20 22:05:50'),
(36, 3, 9, '朋友的這杯藍色魚缸特調，是跟調酒師說她想要偏甜的口味、花果風味，然後就得到了很美的螢光湖水綠色', 3, '2021-09-20 22:05:50', '2021-09-20 22:05:50'),
(37, 6, 9, '微風愛河是香草伏特加、蔓越莓汁、果糖、檸檬汁、\r\n百香果泥、百香果香甜酒、氣泡酒調成的。', 5, '2021-09-20 22:05:50', '2021-09-20 22:05:50'),
(38, 2, 11, '軍艦的部份，我還是第一次吃到這種龍蝦沙拉軍艦\r\n它的龍蝦沙拉是屬於泡沫狀的。雖然口感上不是我喜歡的類型，但以這樣兩貫30的售價來說，還是可以點', 3, '2021-09-29 22:05:50', '2021-09-29 22:05:50'),
(39, 4, 11, '雞肉串的部份，我覺得雞肉味稍重，\r\n而且以它的分量大小和口味來說，\r\n這樣一隻60，我是覺得偏小貴。', 5, '2021-09-29 22:05:50', '2021-09-29 22:05:50'),
(40, 1, 12, '濃情羅勒天使蝦麵的蝦，很紮實、飽滿\r\n它的蝦醬味非常重！（我個人沒有很愛）', 3, '2021-09-29 22:05:50', '2021-09-29 22:05:50'),
(41, 4, 12, '大力推薦薯條控【松露薯條真的必點！】\r\n它是附一碟松露醬，而不是直接加在薯條上\r\n撒在薯條上那一糰的白色絲線，是起司！', 4, '2021-10-10 22:05:50', '2021-10-10 22:05:50'),
(42, 3, 13, '服務好，好幾年沒吃茹絲葵，沒想到比印象中\r\n好吃多了，服務也很細心Bryan推薦餐點都很好吃份量也很足夠，牛排我比較喜歡吃帶一點油脂，口感較嫩的牛肋眼非常合胃口，餐後甜點香蕉奶油派也好吃\r\n配菜烤玉米青椒味跟帶點微酸的口味，解膩但可能自己比較吃不慣，其他都很可以\r\n', 5, '2021-10-10 22:05:50', '2021-10-10 22:05:50'),
(43, 3, 13, '晚餐 茹絲葵大直店，因今天打了很多間飯店都客滿，最後選擇了茹絲葵大直店，平常都是在民生店吃，第一次來大直店，店裡裝潢很穩重，又寬敞，感覺很舒服，店員又超級親切，因女兒一起出來外食，剛好遇到女兒要喝奶時間，泡奶也是有點小麻煩，熱牛奶還需要冷卻，但是店員也非常親切的幫忙，態度真的非常好，又幫忙切蛋糕分裝菜，也擔心我們點太多，讓我們可以平衡著量分著吃，真的很愉快的晚餐。\r\n謝謝店員Leoさん親切服務態度，下次還會再來。', 5, '2021-10-10 22:05:50', '2021-10-10 22:05:50'),
(44, 4, 14, '在十月底前用你訂訂了黑糖雪點奶茶還有嘗試新出的鮪魚法式吐司，訂完很快到店裡就拿到了。對於鮪魚法式吐司感到很驚艷，沒想到這麼好吃，有淡淡的蜂蜜香，甜甜的但意外的跟鮪魚很搭，實在美味。等不及想再點一次！', 5, '2021-10-12 22:05:50', '2021-10-12 22:05:50'),
(45, 3, 14, '英式奶茶不錯喝 微糖/去冰\r\n女店員態度不錯', 5, '2021-11-01 22:05:50', '2021-11-01 22:05:50'),
(46, 2, 14, '平常原本都是在公司附近另一家路易莎消費，有一次早上要去銀行，走另一個出口經過這家，剛好有寄杯優惠所以就買了一些咖啡，要是知道除了當初那位女店員以外的員工都這麼雷，真的不會想在這邊買咖啡寄杯。\r\n\r\n因為前幾天遇到同一批嘻嘻哈哈店員的時候拿到的咖啡是溫冷的，所以今天取咖啡的時候就問說能不能熱一點，店員居然完全不回應，我想說可能只是嘴上不回而已，結果～做事的時候一樣很隨便。可能因為店點在捷運站不缺客人所以員工風氣才這麼差吧。\r\n\r\n兩顆星是給其他認真的員工。\r\n好的員工不是指一定要對客人態度非常和善，我反而覺得有時候太過客氣會養出奧客；只要有基本的禮貌，並且尊重自己的工作也尊重客人就好！\r\n同樣有客人在等，其他人手上在忙，也會說一下「點餐請稍等」，這幾個員工就是，就算看到了也當作沒看到繼續自己聊自己的；同樣的咖啡，其他人就會仔細的攪拌，還會看一下有沒有攪均勻；這幾個員工就是隨便用，客人拿到的咖啡還會有一坨巧克力在底部╮(╯▽╰)╭', 5, '2021-11-09 22:05:50', '2021-11-09 22:05:50'),
(47, 2, 15, '食材還可以，用餐環境非常不行。\r\n桌間擁擠，配合咚咚咚咚的緊湊背景音樂，非常吵鬧煩躁。\r\n沒有置物籃，包包外套得自行想辦法，地板還有點黏。\r\n服務也不行，人才在1樓，完全沒入座就告知用餐只能到幾點幾分，附近沒有固定服務員隨時掌握情況，換網換盤要醬料得眼明手快主動叫住服務員，以為來到平價吃到飽餐廳。', 1, '2021-11-11 22:05:50', '2021-11-11 22:05:50'),
(48, 1, 15, '生日來用餐，送一盤肉片跟氣泡飲，服務很棒', 4, '2021-11-12 22:05:50', '2021-11-12 22:05:50'),
(49, 3, 15, '上到2樓用餐區發現平日中午竟然是客滿的！北部人覺得有點不可思議！\r\n今天選的是1880豪華牛小排套餐，雞湯好喝，沙拉也喜歡，肉質部分牛肉雞肉都有一定水準，豬肉則是普通，升級的干貝也普普，冰淇淋建議還是點Häagen-Dazs。\r\n\r\n服務方面多謝81先生，烤網換得很勤，也頗有耐心。\r\n整體來說還不錯！有機會會想再嘗試別種套餐。', 5, '2021-11-13 22:05:50', '2021-11-13 22:05:50');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`cid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `comment`
--
ALTER TABLE `comment`
  MODIFY `cid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=50;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
